package com.cxin.leetcodetest.nowCoderSolution;

/**
 * 在⼀款虚拟游戏中⽣活，你必须进⾏投资以增强在虚拟游戏中的资产以免被淘汰出局。现有⼀家Bank，它提供有若⼲理财产品 M 个，⻛险及投资
 * 同，你有 N(元)进⾏投资，能接收的总⻛险值为X.你要在可接受范围内选择最优的投资⽅式获得最⼤回报
 * 备注:
 * 1：在虚拟游戏中，每项投资⻛险值相加为总⻛险值:
 * 2：在虚拟游戏中，最多只能投资2个理财产品;
 * 3：在虚拟游戏中，最⼩单位为整数，不能拆分为⼩数;
 * 4：投资额*回报率=投资回报
 * 输⼊描述
 * 第⼀⾏: 产品数 (取值范围[1,20])
 * 总投资额 (整数，取值范围[1,100001])
 * 可接受的总⻛险 (整数，取值范围[1,200])
 * 第⼆⾏: 产品 投资回报率 序列，输⼊为整数，取值范围[1,60]
 * 第三⾏: 产品⻛险值序列，输⼊为整数，取值范围[1,100]
 * 第四⾏: 最⼤投资额度序列，输⼊为整数，取值范围[1，10000]
 * 输出描述
 * 每个产品的投资额序列
 * 示例1：
 * 输⼊
 * 5 100 10
 * 10 20 30 40 50
 * 3 4 5 6 10
 * 20 30 20 40 30
 * 输出
 * 0 30 0 40 0
 * 说明
 * 投资第⼆项30个单位，第四项40个单位，总的投资⻛险为两项相加为4+6=10
 */
public class HJE06 {
}
